/*******************************************************************************
Copyright: 
File name: detect.c  
Description: 检测设备温度、电压、脉冲信号
Author: 初学者cy
Version: 
Date: 
History:       
*******************************************************************************/
/*******************************************************************************
文件包含区
*******************************************************************************/
#include "detect.h"
/*******************************************************************************
常量定义区
*******************************************************************************/
const unsigned short Temp_Table[166] =  //温度参数表
{
  3897 ,3887 ,3877 ,3865 ,3852 ,3837 ,3825 ,3812 ,3798 ,3782 ,  //-40~-31
  3764 ,3749 ,3734 ,3716 ,3697 ,3676 ,3659 ,3640 ,3620 ,3597 ,  //-30~-21
  3572 ,3552 ,3530 ,3507 ,3481 ,3452 ,3429 ,3404 ,3377 ,3348 ,  //-20~-11
  3316 ,3289 ,3261 ,3231 ,3198 ,3163 ,3134 ,3102 ,3069 ,3034 ,  //-10~-1
  2995 ,2964 ,2930 ,2895 ,2857 ,2817 ,2783 ,2748 ,2711 ,2671 ,  //0~9
  2629 ,2594 ,2558 ,2519 ,2479 ,2436 ,2400 ,2363 ,2324 ,2284 ,  //10~19
  2241 ,2205 ,2168 ,2130 ,2090 ,2048 ,2013 ,1977 ,1939 ,1900 ,  //20~29
  1860 ,1826 ,1791 ,1755 ,1718 ,1679 ,1647 ,1614 ,1580 ,1545 ,  //30~39
  1509 ,1479 ,1448 ,1416 ,1383 ,1350 ,1322 ,1293 ,1264 ,1234 ,  //40~49
  1204 ,1178 ,1151 ,1125 ,1098 ,1070 ,1046 ,1022 ,998 ,974 ,    //50~59
  949 ,928 ,907 ,885 ,864 ,842 ,823 ,804 ,785 ,766 ,            //60~69
  746 ,730 ,713 ,696 ,679 ,661 ,646 ,631 ,616 ,601 ,            //70~79
  586 ,573 ,560 ,546 ,533 ,519 ,508 ,496 ,485 ,473 ,            //80~89
  461 ,451 ,440 ,430 ,420 ,409 ,400 ,391 ,382 ,373 ,            //90~99
  364 ,356 ,348 ,340 ,332 ,324 ,317 ,310 ,303 ,296 ,            //101~109
  289 ,283 ,276 ,270 ,264 ,258 ,252 ,247 ,241 ,236 ,            //111~119
  230 ,226 ,221 ,216 ,211 ,207                                  //120~125
};
/*******************************************************************************
公共变量定义区
*******************************************************************************/
/*******************************************************************************
外部变量声明区
*******************************************************************************/
/*******************************************************************************
私有变量定义区
*******************************************************************************/ 
/*******************************************************************************
测试变量定义区
*******************************************************************************/
/*******************************************************************************
内部函数定义区
*******************************************************************************/
/*******************************************************************************
功能代码定义区
*******************************************************************************/
/*******************************************************************************
 Function:      //Detect_Temp
 Description:   //检测设备温度
 Input:         //
                //
 Output:        //
 Return:      	//
 Others:        //
*******************************************************************************/
int8_t Detect_Temp(void)
{
  uint16_t ADC_Data = 0;
  uint8_t i;
  int8_t temp = 0;
   
  GPIO_Init(GPIOA, GPIO_Pin_4,  GPIO_Mode_Out_PP_High_Fast);    // 热敏电阻电源端
  GPIO_Init(GPIOA, GPIO_Pin_5,  GPIO_Mode_In_FL_No_IT);         // 热敏电阻ADC检测端
        
  CLK_PeripheralClockConfig(CLK_Peripheral_ADC1, ENABLE);       //开启ADC时钟
  ADC_Init(ADC1,ADC_ConversionMode_Continuous, 
           ADC_Resolution_12Bit, ADC_Prescaler_1 );             //断续模式 12位 1分频
  ADC_ChannelCmd(ADC1,ADC_Channel_1,ENABLE );                   //通道选择1
  ADC_SamplingTimeConfig(ADC1, ADC_Group_SlowChannels, ADC_SamplingTime_4Cycles);
  ADC_ChannelCmd(ADC1,ADC_Channel_1,ENABLE);                    //开启通道
  ADC_Cmd (ADC1, ENABLE);                                       //开启ADC外围
  ADC_SoftwareStartConv (ADC1);                                 //ADC开始转换
  while(RESET == ADC_GetFlagStatus(ADC1, ADC_FLAG_EOC));        //检测ADC是否转换结束
  ADC_ClearFlag (ADC1,ADC_FLAG_EOC );                           //清除转换结束标志
  ADC_Data =  ADC_GetConversionValue(ADC1);                     //获取ADC值
  ADC_ChannelCmd(ADC1,ADC_Channel_1,DISABLE);                   //关闭通道
  ADC_Cmd(ADC1, DISABLE);                                       //关闭ADC外围
  CLK_PeripheralClockConfig(CLK_Peripheral_ADC1, DISABLE);      //关闭ADC时钟
  
  GPIO_Init(GPIOA, GPIO_Pin_4,  GPIO_Mode_Out_PP_Low_Slow);     // 热敏电阻电源端
  GPIO_Init(GPIOA, GPIO_Pin_5,  GPIO_Mode_Out_PP_Low_Slow);     // 热敏电阻ADC检测端
  
  for(i=0;i<166;i++)
  {
    if(Temp_Table[i] <= ADC_Data)
    break;
  }
  temp = (signed char)i - 40 - 1;
 
  return temp;
}
/*******************************************************************************
 Function:      //
 Description:   //检测设备电压
 Input:         //
                //
 Output:        //
 Return:      	//
 Others:        //
*******************************************************************************/
uint16_t Detect_Voltage(void)
{ 
  uint16_t value = 0;
  float vdd = 0;
  
  CLK_PeripheralClockConfig(CLK_Peripheral_ADC1, ENABLE);       //开启ADC时钟
  ADC_Init (ADC1,ADC_ConversionMode_Continuous, 
            ADC_Resolution_12Bit, ADC_Prescaler_1 );            //断续模式 12位 1分频
  ADC_SamplingTimeConfig(ADC1, ADC_Group_FastChannels, ADC_SamplingTime_384Cycles);
  ADC_Cmd(ADC1, ENABLE);
  ADC_VrefintCmd(ENABLE);                                       //启动内部参考电压
  ADC_ChannelCmd(ADC1,ADC_Channel_Vrefint,ENABLE );             //通道选择内部电压
  ADC_SoftwareStartConv (ADC1);                                 //ADC开始转换
  while(RESET == ADC_GetFlagStatus(ADC1, ADC_FLAG_EOC));       //检测ADC是否转换结束
  ADC_ClearFlag (ADC1,ADC_FLAG_EOC );    
  
  value=ADC_GetConversionValue(ADC1);                           //获取转换值
  vdd=1.224*4096/value;                                         //获得VDD电压，单位V
  ADC_Cmd(ADC1, DISABLE);                                       //关闭ADC外围
  CLK_PeripheralClockConfig(CLK_Peripheral_ADC1,DISABLE);       //关闭ADC时钟
  
  return (uint16_t)(vdd*100);
}
/*************************************END**************************************/