/*******************************************************************************
Copyright: 
File name: mcu.c  
Description: mcu配置
Author: 初学者cy
Version: 
Date: 
History:       
*******************************************************************************/
/*******************************************************************************
文件包含区
*******************************************************************************/
#include "mcu.h"
/*******************************************************************************
常量定义
*******************************************************************************/
/*******************************************************************************
公共变量定义区
*******************************************************************************/
/*******************************************************************************
外部变量声明区
*******************************************************************************/
/*******************************************************************************
私有变量定义区
*******************************************************************************/ 
/*******************************************************************************
测试变量定义区
*******************************************************************************/
/*******************************************************************************
内部函数定义区
*******************************************************************************/
/*******************************************************************************
功能代码定义区
*******************************************************************************/
/*******************************************************************************
 Function:      //
 Description:   //MCU配置
 Input:         //
 Output:        //
 Return:      	//
 Others:        //
*******************************************************************************/
void MCU_Config(void)
{
  RCC_Config();
  GPIO_Config();
  TIM4_Config();
  IWDG_Config();
}
/*******************************************************************************
 Function:      //
 Description:   //系统时钟配置,16M
 Input:         //
 Output:        //
 Return:      	//
 Others:        //
*******************************************************************************/
void RCC_Config(void)                                                   
{
  CLK_HSICmd(ENABLE);
  CLK_SYSCLKSourceConfig(CLK_SYSCLKSource_HSI);
  CLK_SYSCLKDivConfig(CLK_SYSCLKDiv_1);                                         
}
/*******************************************************************************
 Function:      //
 Description:   //GPIO端口配置，推挽输出低
 Input:         //
 Output:        //
 Return:      	//
 Others:        //
*******************************************************************************/
void GPIO_Config(void)
{
  GPIO_Init(GPIOA, GPIO_Pin_All,GPIO_Mode_Out_PP_Low_Slow); 
  GPIO_Init(GPIOB, GPIO_Pin_All,GPIO_Mode_Out_PP_Low_Slow);
  GPIO_Init(GPIOC, GPIO_Pin_All,GPIO_Mode_Out_PP_Low_Slow);
  GPIO_Init(GPIOD, GPIO_Pin_All,GPIO_Mode_Out_PP_Low_Slow);
  GPIO_Init(GPIOE, GPIO_Pin_All,GPIO_Mode_Out_PP_Low_Slow);
  GPIO_Init(GPIOF, GPIO_Pin_All,GPIO_Mode_Out_PP_Low_Slow);
}
/*******************************************************************************
 Function:      //
 Description:   //TIM4配置
 Input:         //
 Output:        //
 Return:      	//
 Others:        //
*******************************************************************************/
void TIM4_Config(void)
{ 
  TIM4_DeInit();
  CLK_PeripheralClockConfig(CLK_Peripheral_TIM4 , ENABLE);              //使能定时器4时钟
  TIM4_TimeBaseInit(TIM4_Prescaler_128 , 125);                          //设置定时器4为128分频，向上计数，计数值为125即为1毫秒的计数值
  TIM4_ITConfig(TIM4_IT_Update , ENABLE);                               //使能向上计数溢出中断
  TIM4_ARRPreloadConfig(ENABLE);                                        //使能定时器4自动重载功能    
  TIM4_Cmd(ENABLE);                                                     //启动定时器4开始计数
  
  ITC_SetSoftwarePriority(TIM4_UPD_OVF_TRG_IRQn, ITC_PriorityLevel_2);  //定时器4中断优先级                    
}
/*******************************************************************************
 Function:      //
 Description:   //看门狗配置
 Input:         //
 Output:        //
 Return:      	//
 Others:        //
*******************************************************************************/
void IWDG_Config(void)  
{ 
  IWDG_Enable();                                //启动看门狗
  IWDG_WriteAccessCmd(IWDG_WriteAccess_Enable); //允许写预分频器和重载寄存器
  IWDG_SetPrescaler(IWDG_Prescaler_256);        //设置IWDG预分频值
  IWDG_SetReload(0xFF);                         //设置重载值1.7s：(255+1)*256/38K = 1.72s
  IWDG_ReloadCounter();                         //重载计数器
}
/*******************************************************************************
 Function:      //
 Description:   //休眠
 Input:         //
 Output:        //
 Return:      	//
 Others:        //
*******************************************************************************/
void Sleep(void)
{  
  PWR_FastWakeUpCmd(ENABLE);                    //开启电源管理里的快速唤醒  
  PWR_UltraLowPowerCmd(ENABLE);                 //使能电源的低功耗模式          
  CLK_HSICmd(DISABLE);                          //关闭内部高速时钟

  halt();
}
/*******************************************************************************
 Function:      //
 Description:   //系统复位
 Input:         //
 Output:        //
 Return:      	//
 Others:        //
*******************************************************************************/
void SystemReset(void)
{
  WWDG->CR = 0x80;              //看门狗复位
}