/*******************************************************************************
Copyright: 
File name: soft_timer.c
Description: 软定时器相关函数、变量
Author: 初学者cy
Version: 
Date: 
History:       
*******************************************************************************/
#ifndef  __SOFT_TIMER_H
#define  __SOFT_TIMER_H
/*******************************************************************************
文件包含区
*******************************************************************************/
#include "include.h"
/*******************************************************************************
宏定义区
*******************************************************************************/
#define SOFT_TIMER_MAX  10      //定时器最大数量
/*******************************************************************************
数据类型定义
*******************************************************************************/
typedef enum
{
  ONCE,                 //单次执行
  CONTINUOUS            //连续执行
}SoftTimer_Mode_TypeDef;

typedef struct                                                            
{
  FunctionalState State;                //定时器状态
  bool Pend;                           //定时器挂起标志
  SoftTimer_Mode_TypeDef Mode;          //执行模式
  uint32_t Duration;                    //定时时长
  void (*Callback)(void);             //回调函数
  uint32_t Counter;                     //计数器
}SoftTimer_TypeDef;
/*******************************************************************************
外部变量声明区
*******************************************************************************/
extern uint32_t DelayCounter_ms;             //延时计数器  
/*******************************************************************************
函数声明区
*******************************************************************************/
void SoftTimer_Process(void);
void SoftTimer_SysTickHandler(void);                                                     
ErrorStatus SoftTimer_CreateTimer(SoftTimer_Mode_TypeDef mode,uint32_t duration,void (*Callback)(void));
ErrorStatus SoftTimer_DeleteTimer(void (*Callback)(void));
uint32_t SoftTimer_GetCounter(void (*Callback)(void));
void Delay_ms(uint32_t ms);
/******************************************************************************/
#endif

/*************************************END**************************************/